Repository: AIGelios/i-Teams
Catalog: rooky_teams/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Date of the match
ru: Дата проведения матча

source: Team 1 goals
ru: Голы оранжевых 🟠

source: Team 2 goals
ru: Голы жёлтых 🟡

source: Notes about match
ru: Заметки о матче

source: Match information updated sucessfully.
ru: Информация о матче успешно обновлена.

source: Match deleted sucessfully.
ru: Матч успешно удалён.

source: Filter by role on the field
ru: Отфильтровать игроков по роли на поле

source: First name
ru: Имя игрока

source: Last name
ru: Фамилия

source: Role on the field
ru: Основная роль на поле

source: Goalkeeper skill
ru: Навык игры на воротах 🥅

source: Defender skill
ru: Навык игры в защите 🛡️

source: Forward skill
ru: Навык игры в нападении 🗡️

source: Goalkeeper
ru: 🥅 Вратарь

source: Defender
ru: 🛡️ Защитник

source: Forward
ru: 🗡️ Нападающий

source: 1 - Very bad
ru: 1 - Плохо

source: 2 - Bad
ru: 2 - Ниже среднего

source: 3 - Medium
ru: 3 - Нормально

source: 4 - Good
ru: 4 - Хорошо

source: 5 - Excellent
ru: 5 - Отлично

source: No Team
ru: Не в команде

source: Team 1
ru: Оранжевые 🟠

source: Team 2
ru: Жёлтые 🟡

source: Player successfully added!
ru: Игрок успешно добавлен в базу данных.

source: Player successfully updated!
ru: Данные игрока успешно изменены в базе данных.

source: Player successfully deleted from database
ru: Игрок успешно удалён из базы данных.

source: Player successfully added to the next match
ru: Игрок успешно добавлен в предстоящую игру.

source: Error. Cannot add player to roster!
ru: Ошибка добавления игрока в предстоящую игру!

source: Player successfully removed from roster
ru: Игрок успешно удалён из списка на ближайшую игру.

source: Error. Cannot remove player from roster!
ru: Ошибка удаления игрока из списка на предстоящую игру!

source: Roster successfully cleared
ru: Список участников ближайшей игры успешно очищен.

source: Error. Cannot clear roster!
ru: Ошибка очистки списка участников ближайшей игры!

source: Lineups generated successfully.
ru: Составы команд успешно сгенерированы.

source: Unable to create teams. Add more players to the roster!
ru: Невозможно создать команды. Добавьте больше игроков в список на игру.

source: Match successfully created.
ru: Матч успешно создан, составы сохранены.

source: My Github
ru: Профиль ai_gelios на Github

source: Source
ru: Исходный код проекта

source: an amateur football team lineups generator
ru: Генератор составов любительских футбольных команд

source: i-Teams is the system for automatical generating or manual creating of amateur football team lineups. Lineups depends on player's skill and his role on a field.
ru: i-Teams - cистема автоматической генерации составов команд для любительского футбола. Автоматическая генерация создаёт сбалансированные команды в зависимости от уровня мастерства игроков и их роли на поле.

source: Start to make teams
ru: Перейти к созданию команд

source: Match deletion
ru: Удаление матча

source: Do you really want to delete match
ru: Вы действительно хотите удалить матч

source: from database
ru: из базы данных

source: Yes, delete
ru: Да, удалить

source: Match information
ru: Информация о матче

source: Update match information
ru: Обновить информацию о матче

source: Delete match
ru: Удалить матч

source: Team 1 lineup
ru: Состав оранжевых 🟠

source: Player name (average skill)
ru: Полное имя (средний навык)

source: skills
ru: Навыки

source: DEF:
ru: ЗАЩ:

source: FRW:
ru: НАП:

source: GK:
ru: ВР:

source: Team 2 lineup
ru: Состав жёлтых 🟡

source: Match notes:
ru: Заметки о матче:

source: Matches
ru: Матчи

source: Match date
ru: Дата матча

source: Lineups and match information
ru: Составы и дополнительная информация

source: Actions
ru: Действия

source: Match details
ru: Детали матча

source: Update
ru: Изменить

source: Delete
ru: Удалить

source: Match information updating
ru: Обновление информации о матче

source: Players
ru: Игроки

source: Roster for the next game
ru: Участники предстоящего матча

source: Roster clearing
ru: Очистка списка участников ближайшей игры

source: Do you really want clear player list for the next game?
ru: Вы действительно хотите очистить список игроков, идущих на матч?

source: Yes, clear.
ru: Да, очистить

source: Adding a new player
ru: Добавление нового игрока в базу данных

source: Add player
ru: Добавить игрока

source: Player deletion
ru: Удаление игрока из базы данных

source: Do you really want to delete player
ru: Вы действительно хотите удалить игрока

source: Player details
ru: Информация об игроке

source: Player matches
ru: Матчи с участием игрока

source: Apply filter
ru: Применить фильтр

source: Add new player
ru: + Добавить нового игрока

source: Player name
ru: Имя игрока

source: Status
ru: Статус

source: in roster
ru: В ИГРЕ

source: Add to roster
ru: Добавить в игру

source: The proposal of the teams for the match
ru: Предложение по составам команд на матч

source: Generate lineups again (F5)
ru: Генерировать составы снова (F5)

source: Save linups and create match
ru: Сохранить составы и создать матч

source: Players for the next match
ru: Участники предстоящего матча

source: Remove from roster
ru: Не пойдёт играть

source: Automatically generate lineups
ru: Генерировать составы команд автоматически

source: Clear roster
ru: Очистить список участников

source: Player data updating
ru: Обновление информации об игроке

source: Update player
ru: Обновить данные игрока
